#### ExternallyTaggedNonBRep Members

---

|  |
| --- |
| ExternallyTaggedNonBRep Class   Constructors   Methods   Properties   See Also |

The  ExternallyTaggedNonBRep  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExternallyTaggedNonBRep | Constructs an ExternallyTaggedGeometryObject associating a given ExternalGeometryId with a particular GeometryObject. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  ExternallyTaggedGeometryObject  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ExternalId | The external Id of the geometry object. (Inherited from  ExternallyTaggedGeometryObject  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  ExternallyTaggedGeometryObject  .) |

# See Also

ExternallyTaggedNonBRep Class

Autodesk.Revit.DB Namespace